/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET FOREIGN_KEY_CHECKS=0 */;

UPDATE `creature_template` SET `mechanic_immune_mask` = '650854399', `ScriptName` = 'boss_sha_of_pride' WHERE `entry` = 71734;
UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_norushen' WHERE `entry` = 71965;
UPDATE `creature_template` SET `ScriptName` = 'npc_sha_of_pride_lowerwalker' WHERE `entry` = 61348;

DELETE FROM creature where id in (72172, 72791, 71965, 61348);

DELETE FROM creature_text WHERE entry in (71734, 71965, 61348, 72779);
INSERT INTO `creature_text` (`entry`, `groupid`, `id`, `text`, `type`, `language`, `probability`, `emote`, `duration`, `sound`, `comment`) VALUES
(71734, 0, 0, 'Идите ко мне. Отдайтесь гордыне. Покажите свое «величие»!', 14, 0, 100, 0, 0, 38899, 0),
(71734, 1, 0, 'Как глупо...', 14, 0, 100, 0, 0, 38896, 0),
(71734, 2, 0, 'Ты лучше всех своих друзей!', 14, 0, 100, 0, 0, 38908, 0),
(71734, 3, 0, 'Надменность питает меня!', 14, 0, 100, 0, 0, 38911, 0),
(71734, 4, 0, 'Надменность подчинила тебя.', 14, 0, 100, 0, 0, 38909, 0),
(71734, 5, 0, 'Отдайся... гордыне!', 14, 0, 100, 0, 0, 38910, 0),
(71734, 6, 0, 'Не кланяйтесь ни королю, ни вождю.', 14, 0, 100, 0, 0, 38912, 0),
(71734, 7, 0, 'Какая слабость.', 14, 0, 100, 0, 0, 38905, 0),
(71734, 8, 0, 'Гордыня затуманила твой взор, слуга титанов! ТЕБЕ НЕ ОДОЛЕТЬ МЕНЯ!', 14, 0, 100, 0, 0, 38898, 0),
(71734, 9, 0, 'Это было ваше слабое звено.', 14, 0, 100, 0, 0, 38906, 0),
(71734, 10, 0, 'Вини своих друзей!', 14, 0, 100, 0, 0, 38907, 0),
(71734, 11, 0, '|TInterface\Icons\sha_ability_rogue_sturdyrecuperate.blp:20|t %s начинает применять заклинание |cFFF00000|Hspell:144563|h[Пленение]|h|r!', 41, 0, 100, 0, 0, 0, 0),
(71734, 12, 0, '|TInterface\Icons\sha_spell_warlock_demonsoul.blp:20|t %s начинает применять заклинание |cFFF00000|Hspell:144400|h[Раздутая гордыня]|h|r!', 41, 0, 100, 0, 0, 0, 0),
(71734, 13, 0, '|TInterface\Icons\sha_ability_warrior_bloodnova.blp:20|t Вы создали |cFFF00000|Hspell:145066|h[проекцию]|h|r!', 42, 0, 100, 0, 0, 0, 0),
(71734, 14, 0, '|TInterface\Icons\sha_ability_rogue_envelopingshadows.blp:20|t Вас захватывает |cFFF00000|Hspell:146817|h[аура гордыни]|h|r!', 42, 0, 100, 0, 0, 0, 0),
(71734, 15, 0, 'Гордыня затуманила твой взор, слуга титанов! ТЕБЕ НЕ ОДОЛЕТЬ МЕНЯ!', 14, 0, 100, 0, 0, 38898, 0),
-- Norushen
(71965, 0, 0, 'Вы выдержали испытание и доказали, что достойны. Но помните: внутри вас ждут куда более серьезные трудности. Как только будете готовы, можете войти.', 14, 0, 100, 0, 0, 38882, 0),
(71965, 1, 0, 'Порча усиливается. Фрагменты нужно уничтожить, иначе будет поздно.', 14, 0, 100, 0, 0, 38903, 0),
(71965, 2, 0, 'Не сработало. Он идет. Приготовьтесь. Будьте стойки душой и сердцем.', 14, 0, 100, 0, 0, 38904, 0),
(71965, 3, 0, 'Отбросьте высокомерие.', 14, 0, 100, 0, 0, 38901, 0),
(71965, 4, 0, 'Будьте скромнее.', 14, 0, 100, 0, 0, 38900, 0),
(71965, 5, 0, 'Вы... должны... удержать... его...', 14, 0, 100, 0, 0, 38902, 'Ша Гордыни'),
(71965, 6, 0, 'Будьте скромнее.', 14, 0, 100, 0, 0, 0, 0),
(71965, 7, 0, 'Будьте скромнее.', 14, 0, 100, 0, 0, 0, 0),
(71965, 8, 0, 'Отбросьте высокомерие.', 14, 0, 100, 0, 0, 0, 0),
--
(61348, 0, 0, 'Тажань Чжу!', 14, 0, 100, 0, 0, 38144, 0),
(61348, 1, 0, 'Тише. Тише. Я отведу тебя к лекарям.', 12, 0, 100, 0, 0, 38145, 'Тажань Чжу'),
(61348, 2, 0, 'Я найду помощь! Удерживайте ша как можно дольше!', 14, 0, 100, 0, 0, 38146, 'Тажань Чжу'),
(61348, 3, 0, 'Герои! Вы живы. Я привел подмогу.', 14, 0, 100, 0, 0, 38147, 0),
--
(72779, 0, 0, '*кашляет* ', 12, 0, 100, 0, 0, 38307, 'Хранитель истории Чо'),
(72779, 1, 0, 'Чо... чужаки... это все ОНИ... нельзя было их впускать...', 12, 0, 100, 0, 0, 38308, 'Хранитель истории Чо');


SET @id = 0;
SET @entry = 71965;
DELETE FROM `script_waypoint` WHERE `entry` = @entry;
INSERT INTO `script_waypoint` (`entry`, `pointid`, `location_x`, `location_y`, `location_z`, `point_comment`) VALUES 
(@entry, @id := @id+ 1, 794.3706, 894.219, 371.1301, NULL),
(@entry, @id := @id+ 1, 789.6668, 915.727, 357.1924, NULL),
(@entry, @id := @id+ 1, 783.7484, 946.2997, 357.3061, NULL),
(@entry, @id := @id+ 1, 776.5015, 978.3145, 356.5714, NULL),
-- 145979
(@entry, @id := @id+ 1, 763.9922, 1040.491, 357.2061, NULL),
-- Порча усиливается. Фрагменты нужно уничтожить, иначе будет поз
(@entry, @id := @id+ 1, 763.9922, 1040.491, 357.2061, NULL);

SET @id = 0;
SET @entry = 61348;
DELETE FROM `script_waypoint` WHERE `entry` = @entry;
INSERT INTO `script_waypoint` (`entry`, `pointid`, `location_x`, `location_y`, `location_z`, `point_comment`) VALUES 
(@entry, @id := @id+ 1, 801.0469, 893.2049, 371.13, NULL),
(@entry, @id := @id+ 1, 796.3127, 918.0088, 356.9289, NULL),
(@entry, @id := @id+ 1, 792.0138, 942.7969, 356.4434, NULL),
(@entry, @id := @id+ 1, 785.804, 973.9192, 356.4572, NULL),
(@entry, @id := @id+ 1, 781.9784, 997.565, 356.5898, NULL),
(@entry, @id := @id+ 1, 755.4828, 1050.636, 356.2061, NULL),
-- Text: *кашляет* 
-- Text: Тажань Чжу!
(@entry, @id := @id+ 1, 766.8073, 1023.274, 357.3615, NULL),
-- Я найду помощь! Удерживайте ша как можно дольше!
(@entry, @id := @id+ 1, 768.5957, 1015.858, 356.6122, NULL),
(@entry, @id := @id+ 1, 776.3892, 978.5554, 356.4566, NULL),
(@entry, @id := @id+ 1, 784.4169, 941.2675, 356.4563, NULL),
(@entry, @id := @id+ 1, 786.0801, 934.1655, 356.2004, NULL),
(@entry, @id := @id+ 1, 790.1033, 916, 357.3003, NULL),
(@entry, @id := @id+ 1, 791.4607, 908.041, 362.6729, NULL),
(@entry, @id := @id+ 1, 792.4047, 904.1388, 365.1732, NULL),
(@entry, @id := @id+ 1, 800.2216, 866.7416, 371.2193, NULL),
(@entry, @id := @id+ 1, 803.4233, 851.9974, 371.3574, NULL);